Show / Hide Table of Contents
Class ConversionDictionary<TKey>
Inheritance
System.Object
System.Collections.Generic.Dictionary<TKey, System.Int32>
SerializableDictionary<TKey, System.Int32>
ConversionDictionary<TKey>
ConversionDictionaryInt
ConversionDictionaryString
Implements
System.Collections.Generic.IDictionary<TKey, System.Int32>
System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>
System.Collections.IDictionary
System.Collections.ICollection
System.Collections.Generic.IReadOnlyDictionary<TKey, System.Int32>
System.Collections.Generic.IReadOnlyCollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>
System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>
System.Collections.IEnumerable
System.Runtime.Serialization.IDeserializationCallback
System.Xml.Serialization.IXmlSerializable
System.Runtime.Serialization.ISerializable
Inherited Members
 SerializableDictionary<TKey, Int32>.ISerializable.GetObjectData(SerializationInfo, StreamingContext)
 SerializableDictionary<TKey, Int32>.IXmlSerializable.WriteXml(XmlWriter)
 SerializableDictionary<TKey, Int32>.IXmlSerializable.ReadXml(XmlReader)
 SerializableDictionary<TKey, Int32>.IXmlSerializable.GetSchema()
 SerializableDictionary<TKey, Int32>.ValueSerializer
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Add(TKey, System.Int32)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.Add(System.Collections.Generic.KeyValuePair<TKey, System.Int32>)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.Contains(System.Collections.Generic.KeyValuePair<TKey, System.Int32>)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.Remove(System.Collections.Generic.KeyValuePair<TKey, System.Int32>)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Clear()
 System.Collections.Generic.Dictionary<TKey, System.Int32>.ContainsKey(TKey)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.ContainsValue(System.Int32)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.IEnumerable<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, System.Int32>.GetObjectData(System.Runtime.Serialization.SerializationInfo, System.Runtime.Serialization.StreamingContext)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.OnDeserialization(System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Remove(TKey)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.TryGetValue(TKey, System.Int32)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.CopyTo(System.Collections.Generic.KeyValuePair<TKey, System.Int32>[], System.Int32)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.ICollection.CopyTo(System.Array, System.Int32)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IEnumerable.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.get_Item(System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.set_Item(System.Object, System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Add(System.Object, System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Contains(System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.GetEnumerator()
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Remove(System.Object)
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Comparer
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Count
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Keys
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.IDictionary<TKey, System.Int32>.Keys
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.IReadOnlyDictionary<TKey, System.Int32>.Keys
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Values
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.IDictionary<TKey, System.Int32>.Values
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.IReadOnlyDictionary<TKey, System.Int32>.Values
 System.Collections.Generic.Dictionary<TKey, System.Int32>.Item[TKey]
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.Generic.ICollection<System.Collections.Generic.KeyValuePair<TKey, System.Int32>>.IsReadOnly
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.ICollection.IsSynchronized
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.ICollection.SyncRoot
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.IsFixedSize
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.IsReadOnly
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Keys
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Values
 System.Collections.Generic.Dictionary<TKey, System.Int32>.System.Collections.IDictionary.Item[System.Object]
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public abstract class ConversionDictionary<TKey> : SerializableDictionary<TKey, int>, IDictionary<TKey, int>, ICollection<KeyValuePair<TKey, int>>, IDictionary, ICollection, IReadOnlyDictionary<TKey, int>, IReadOnlyCollection<KeyValuePair<TKey, int>>, IEnumerable<KeyValuePair<TKey, int>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Type Parameters
 Name |  Description
 TKey
Methods
Improve this Doc   View Source
GetExEntityId(TKey)
Declaration
public int GetExEntityId(TKey name)
Parameters
 Type |  Name |  Description
 TKey |  name
Returns
 Type |  Description
 System.Int32
Improve this Doc   View Source
GetKey(Int32)
Declaration
protected abstract TKey GetKey(int id)
Parameters
 Type |  Name |  Description
 System.Int32 |  id
Returns
 Type |  Description
 TKey
Improve this Doc   View Source
GetKey(String)
Declaration
protected abstract TKey GetKey(string name)
Parameters
 Type |  Name |  Description
 System.String |  name
Returns
 Type |  Description
 TKey
Improve this Doc   View Source
GetSaveKey(Int32)
Declaration
public abstract TKey GetSaveKey(int Id)
Parameters
 Type |  Name |  Description
 System.Int32 |  Id
Returns
 Type |  Description
 TKey
Improve this Doc   View Source
InitMerge(IList<ProjectItem>)
Declaration
public void InitMerge(IList<ProjectItem> source)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IList<ProjectItem> |  source
Improve this Doc   View Source
MapId(TKey)
Declaration
public int MapId(TKey key)
Parameters
 Type |  Name |  Description
 TKey |  key
Returns
 Type |  Description
 System.Int32
Improve this Doc   View Source
Merge(IList<ProjectItem>)
Declaration
public void Merge(IList<ProjectItem> source)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.IList<ProjectItem> |  source
Implements
 System.Collections.Generic.IDictionary<TKey, TValue>
 System.Collections.Generic.ICollection<T>
 System.Collections.IDictionary
 System.Collections.ICollection
 System.Collections.Generic.IReadOnlyDictionary<TKey, TValue>
 System.Collections.Generic.IReadOnlyCollection<T>
 System.Collections.Generic.IEnumerable<T>
 System.Collections.IEnumerable
 System.Runtime.Serialization.IDeserializationCallback
 System.Xml.Serialization.IXmlSerializable
 System.Runtime.Serialization.ISerializable
 Improve this Doc
 View Source